; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v1 - type_2 ?v7 - type_1)
 	      (pred_1 ?v6 - object ?v7 - type_1)
	      (pred_2 ?v1 - type_2 ?v5 - type_3)
	      (pred_3 ?v1 - type_2 ?v6 - object ?v5 - type_3))

   (:action op_1
       :parameters  (?v1 - type_2 ?v2 ?v3 - type_1)
       :precondition (and  (pred_4 ?v1 ?v2))
       :effect (and  (pred_4 ?v1 ?v3)
		     (not (pred_4 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_2 ?v8 - object ?v4 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v4) (pred_4 ?v1 ?v4) (pred_2 ?v1 ?v5))
       :effect (and (pred_3 ?v1 ?v8 ?v5)
		    (not (pred_1 ?v8 ?v4)) 
		    (not (pred_2 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_2 ?v8 - object ?v4 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v8 ?v5) (pred_4 ?v1 ?v4))
       :effect (and (pred_1 ?v8 ?v4)
		    (pred_2 ?v1 ?v5)
		    (not (pred_3 ?v1 ?v8 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_02 - type_2
obj_04 obj_03 obj_08 obj_01 - type_3
obj_05 obj_09 obj_12 obj_11 - type_1
obj_14 obj_06 obj_07 obj_13 - object)
(:init
(pred_4 obj_10 obj_09)
(pred_2 obj_10 obj_04)
(pred_2 obj_10 obj_03)
(pred_4 obj_02 obj_05)
(pred_2 obj_02 obj_08)
(pred_2 obj_02 obj_01)
(pred_1 obj_14 obj_12)
(pred_1 obj_06 obj_12)
(pred_1 obj_07 obj_09)
(pred_1 obj_13 obj_05)
)
(:goal
(and
(pred_1 obj_14 obj_12)
(pred_1 obj_06 obj_09)
(pred_1 obj_07 obj_12)
(pred_1 obj_13 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_10 obj_09) (pred_4 obj_02 obj_09))))
  )
)
)

; plan
1. (op_2 obj_10 obj_07 obj_09 obj_03)
   deleted: (pred_1 obj_07 obj_09) (pred_2 obj_10 obj_03)
   added: (pred_3 obj_10 obj_07 obj_03)
   goals met: 1 of 4
2. (op_2 obj_02 obj_13 obj_05 obj_01)
   deleted: (pred_1 obj_13 obj_05) (pred_2 obj_02 obj_01)
   added: (pred_3 obj_02 obj_13 obj_01)
   goals met: 1 of 4
3. (op_1 obj_02 obj_05 obj_12)
   deleted: (pred_4 obj_02 obj_05)
   added: (pred_4 obj_02 obj_12)
   goals met: 1 of 4
4. (op_1 obj_10 obj_09 obj_12)
   deleted: (pred_4 obj_10 obj_09)
   added: (pred_4 obj_10 obj_12)
   goals met: 1 of 4
5. (op_2 obj_02 obj_06 obj_12 obj_08)
   deleted: (pred_1 obj_06 obj_12) (pred_2 obj_02 obj_08)
   added: (pred_3 obj_02 obj_06 obj_08)
   goals met: 1 of 4
6. (op_3 obj_10 obj_07 obj_12 obj_03)
   deleted: (pred_3 obj_10 obj_07 obj_03)
   added: (pred_1 obj_07 obj_12) (pred_2 obj_10 obj_03)
   goals met: 2 of 4
7. (op_1 obj_02 obj_12 obj_09)
   deleted: (pred_4 obj_02 obj_12)
   added: (pred_4 obj_02 obj_09)
   goals met: 2 of 4
8. (op_3 obj_02 obj_13 obj_09 obj_01)
   deleted: (pred_3 obj_02 obj_13 obj_01)
   added: (pred_1 obj_13 obj_09) (pred_2 obj_02 obj_01)
   goals met: 3 of 4
9. (op_3 obj_02 obj_06 obj_09 obj_08)
   deleted: (pred_3 obj_02 obj_06 obj_08)
   added: (pred_1 obj_06 obj_09) (pred_2 obj_02 obj_08)
   goals met: 4 of 4
